const translations = {
  seo: {
    defaultDescription:
      "GG56는 혁신적인 기술 솔루션으로 글로벌 변화를 주도하고 있습니다. 함께 변화를 만들어 갑시다. GG56 Limited - 글로벌 선을 위하여.",
  },
  page: {
    it: "IT",
    fintech: "FIN-Tech",
    blockchain: "블록체인",
    exchange: "암호화폐 거래소",
    "digital-bank": "디지털 뱅크",
    "advisory-board": "자문 위원회",
    about: "회사개요",
    "founders-message": "창립자 인사말",
    contact: "연락처",
  },
  nav: {
    home: "홈",
    business: "사업소개",
    about: "회사소개",
  },
  it: {
    h1: "솔루션",
    app: {
      h2: "FingeRate App",
      p: "FingerRate앱은 설문조사 수행 방식을 혁신하여 기업에게 귀중한 피드백을 제공하는 동시에 참여자에게 보상을 제공합니다. FingerRate앱은 메타버스를 기반으로 한 최초의 앱으로 실제 지도를 사용하여 설문조사에 참여하면 보상을 받을 수 있는 흥미로운 기회를 제공합니다. 가치 없는 설문조사에 시간을 낭비하지 마시고 지금 바로 FingerRate와 함께 보상을 받으세요!",
      ul: ["보상 기반 설문조사", "실제 세계 지도", "언제 어디서나", "무료!"],
      cta: "지금 시작하기!",
    },
    bot: {
      h2: "FingeRate Bot",
      p: "FingeRate 생태계를 통해 기업에 고객 데이터를 제공하는 것을 넘어, 터치리스 시스템을 통해 고객에게 안전하고 편리한 경험을 보장합니다. 실시간 데이터 분석을 통해 고객 행동에 대한 깊은 이해를 제공합니다.",
      cta: "자세히 알아보기",
    },
    passngo: {
      h2: "Pass&Go",
      p: "Pass&Go의 주요 서비스는 QR 코드 형태의 디지털 자격 증명을 생성하는 것입니다. 이 자격 증명은 음성 검사 통과 또는 면역력 보유와 같은 특정 지표를 확인하여 사회 및 경제 활동에 완전히 참여할 수 있도록 합니다. Pass&Go를 사용하면 더 이상 물리적 문서를 휴대하거나 분실 또는 손상된 문서에 대해 걱정할 필요가 없습니다.",
      cta: "자세히 알아보기",
    },
    signis: {
      h2: "SIGNIS FR",
      p: "SIGNIS FR은 세계 최초의 가톨릭 메타버스 플랫폼입니다. SIGNIS(국제 가톨릭 커뮤니케이션 협회)의 공동 사명을 위해 전 세계 사람들이 연결하고 상호 작용하며 단결할 수 있는 허브 역할을 합니다. SIGNIS FR은 약 50억 명의 디지털 친화적인 MZ 세대를 모읍니다. 이 플랫폼을 통해 가톨릭 신자와 메타버스 애호가를 포함한 다양한 배경의 개인들이 시간과 공간의 한계를 초월하여 이해, 공감 및 다양한 경험을 촉진하고 가톨릭을 홍보하며 세계 평화를 위해 노력할 수 있습니다.",
      cta: "자세히 알아보기",
    },
  },
  about: {
    h1: "GG56 – Global Good 5 Oceans 6 Continents",
  },
  "founders-message": {
    h1: "창립자 인사말",
    message: {
      overview: {
        h2: "한승수, GG56 창립자",
        p: "글로벌 선(善)을 육성하기 위해서는 시대에 발맞춰 전진해야 합니다. 그래서 우리는 최첨단 기술과 견고한 데이터 보안 프로토콜의 개발을 우선시하며, 사용자 경험을 향상시키기 위해 블록체인을 활용합니다. 또한, 투명성이 강조된 선(善)의 순환을 갖춘 플랫폼을 구축하여 사회에 보답하는 것에 중점을 두고 있습니다.",
      },
    },
  },
  "advisory-board": {
    h1: "자문 위원회",
    about: {
      h2: "전략적 방향을 제시하는 전문가 그룹",
      p: "GG56의 자문위원회는 풍부한 경험과 지식을 갖춘 전문가들로 구성되어 있으며 조직에 전략적인 방향성과 인사이트를 제공합니다. 다양한 분야의 전문성을 바탕으로 GG56의 방향성, 운영, 주요 사업에 대해 검토하고 조언하는 핵심적인 역할을 수행합니다.",
    },
    international: {
      h2: "글로벌 자문위원회",
    },
    local: {
      h2: "지역 자문 위원회",
    },
  },
  contact: {
    h1: "연락처",
    info: {
      h2: "우리는 여러분의 의견을 기다리고 있습니다!",
      p: "우리 회사에 연락할 수 있는 방법은 여러 가지가 있습니다. 이메일이나 전화로 문의하시거나 서울 중심부에 위치한 사무실을 방문하셔도 됩니다.",
    },
  },
} as const;

export default translations;
